{
  "dailyPlan": {
    "breakfast": {
      "name": "Breakfast Burrito with Scrambled Eggs, Black Beans, and Avocado",
      "ingredients": [
        "2 large eggs",
        "1/4 cup black beans",
        "1/4 avocado",
        "1 whole wheat tortilla",
        "1 tbsp salsa",
        "1 tbsp shredded cheese (optional)"
      ],
      "preparation": "Scramble eggs in a pan. Heat black beans. Mash avocado. Warm tortilla. Assemble burrito with all ingredients. Add salsa and cheese (optional).",
      "nutritionalBenefits": "Provides protein, healthy fats, fiber, and complex carbohydrates for sustained energy.",
      "healthNotes": "Good source of protein and healthy fats to start the day, promoting satiety and muscle growth."
    },
    "lunch": {
      "name": "Chicken Quesadilla with Mexican Rice",
      "ingredients": [
        "4 oz cooked chicken breast (shredded)",
        "1 whole wheat tortilla",
        "1/4 cup shredded cheese",
        "1/4 cup Mexican rice (brown rice cooked with tomato, onion, and spices)",
        "2 tbsp salsa",
        "1 tbsp sour cream (optional)"
      ],
      "preparation": "Place chicken and cheese on one half of the tortilla. Fold in half. Cook in a pan over medium heat until golden brown and cheese is melted. Serve with Mexican rice and salsa. Add sour cream (optional).",
      "nutritionalBenefits": "Provides lean protein, carbohydrates, and fiber. Mexican rice adds vitamins and minerals.",
      "healthNotes": "Balanced meal providing protein and carbohydrates for energy and muscle support."
    },
    "dinner": {
      "name": "Tacos al Pastor (using lean pork) with Corn Tortillas and Pineapple Salsa",
      "ingredients": [
        "4 oz lean pork (marinated in al pastor seasoning)",
        "3 corn tortillas",
        "1/4 cup pineapple salsa (diced pineapple, red onion, cilantro, lime juice)",
        "1/4 cup chopped cilantro",
        "1 lime wedge"
      ],
      "preparation": "Cook pork. Warm tortillas. Assemble tacos with pork, pineapple salsa, and cilantro. Serve with a lime wedge.",
      "nutritionalBenefits": "Lean protein source. Corn tortillas are a source of complex carbohydrates. Pineapple salsa provides vitamins and antioxidants.",
      "healthNotes": "Lean protein supports muscle growth. Pineapple salsa adds a sweet and savory flavor and provides vitamin C."
    },
    "snacks": [
      {
        "name": "Greek Yogurt with Granola and Berries",
        "ingredients": [
          "1 cup plain Greek yogurt (full-fat)",
          "1/4 cup granola",
          "1/2 cup mixed berries (strawberries, blueberries, raspberries)"
        ],
        "preparation": "Combine Greek yogurt, granola, and berries in a bowl.",
        "nutritionalBenefits": "Provides protein, calcium, probiotics, and antioxidants.",
        "healthNotes": "Good source of protein and healthy fats to support muscle growth and satiety."
      }
    ]
  },
  "nutritionalFocus": [
    {
      "nutrient": "Protein",
      "reason": "Essential for muscle growth and repair, crucial for weight gain.",
      "sources": [
        "Eggs",
        "Chicken",
        "Pork",
        "Greek Yogurt",
        "Black Beans"
      ]
    },
    {
      "nutrient": "Healthy Fats",
      "reason": "Provides energy, supports hormone production, and aids in nutrient absorption.",
      "sources": [
        "Avocado",
        "Greek Yogurt",
        "Nuts (in granola)"
      ]
    },
    {
      "nutrient": "Complex Carbohydrates",
      "reason": "Provides sustained energy and supports muscle glycogen replenishment.",
      "sources": [
        "Whole Wheat Tortillas",
        "Corn Tortillas",
        "Brown Rice",
        "Beans"
      ]
    }
  ],
  "avoidList": [
    {
      "food": "Excessive Sugary Drinks",
      "reason": "Provide empty calories and can hinder healthy weight gain."
    }
  ],
  "weeklyHabitTips": [
    "Eat consistently throughout the day to ensure adequate calorie intake.",
    "Focus on nutrient-dense foods to support muscle growth and overall health.",
    "Incorporate strength training exercises to build muscle mass effectively."
  ]
}