{
  "dailyPlan": {
    "breakfast": {
      "name": "Mexican Tofu Scramble with Black Beans and Avocado",
      "ingredients": [
        "Firm Tofu",
        "Black Beans",
        "Avocado",
        "Onion",
        "Bell Pepper",
        "Tomato",
        "Chili Powder",
        "Cumin",
        "Turmeric",
        "Olive Oil",
        "Cilantro"
      ],
      "preparation": "Crumble tofu and sautee with chopped onion and bell pepper. Add black beans, diced tomato, chili powder, cumin, and turmeric. Cook until heated through. Serve with sliced avocado and chopped cilantro.",
      "nutritionalBenefits": "High in protein, fiber, and healthy fats. Provides essential amino acids and supports muscle growth.",
      "healthNotes": "Tofu is a complete protein source and a great alternative to meat. Avocado provides healthy monounsaturated fats."
    },
    "lunch": {
      "name": "Vegetarian Burrito Bowl with Quinoa",
      "ingredients": [
        "Quinoa",
        "Black Beans",
        "Corn",
        "Salsa",
        "Avocado",
        "Red Onion",
        "Bell Pepper",
        "Lime Juice",
        "Cilantro",
        "Vegetable Broth"
      ],
      "preparation": "Cook quinoa in vegetable broth. Combine cooked quinoa with black beans, corn, salsa, diced avocado, red onion, and bell pepper. Drizzle with lime juice and garnish with cilantro.",
      "nutritionalBenefits": "Provides complex carbohydrates, protein, fiber, and vitamins. Supports energy levels and digestive health.",
      "healthNotes": "Quinoa is a complete protein source and a good source of iron. Black beans are high in fiber and help regulate blood sugar levels."
    },
    "dinner": {
      "name": "Sweet Potato and Black Bean Enchiladas with Mole Sauce",
      "ingredients": [
        "Sweet Potatoes",
        "Black Beans",
        "Corn Tortillas",
        "Mole Sauce (Vegetarian)",
        "Onion",
        "Garlic",
        "Cilantro",
        "Vegetable Broth",
        "Cheese (Optional, check dietary preference)",
        "Olive Oil"
      ],
      "preparation": "Roast sweet potatoes until tender. Sautee onion and garlic, then add black beans and diced sweet potatoes. Fill corn tortillas with the mixture and roll them up. Place in a baking dish, cover with mole sauce, and bake until heated through. Garnish with cilantro and cheese (if desired).",
      "nutritionalBenefits": "Rich in vitamins, minerals, and fiber. Provides antioxidants and supports immune function.",
      "healthNotes": "Sweet potatoes are a good source of Vitamin A and potassium. Black beans are a good source of protein and fiber."
    },
    "snacks": [
      {
        "name": "Mexican Fruit Salad with Chili Lime Dressing",
        "ingredients": [
          "Mango",
          "Pineapple",
          "Watermelon",
          "Papaya",
          "Lime Juice",
          "Chili Powder"
        ],
        "preparation": "Dice mango, pineapple, watermelon, and papaya. Combine with lime juice and chili powder.",
        "nutritionalBenefits": "Provides vitamins, minerals, and hydration. Supports energy levels and overall health.",
        "healthNotes": "Fruits are a good source of vitamins, minerals, and antioxidants."
      }
    ]
  },
  "nutritionalFocus": [
    {
      "nutrient": "Protein",
      "reason": "Essential for muscle growth and repair, particularly important for weight gain.",
      "sources": [
        "Tofu",
        "Black Beans",
        "Quinoa",
        "Nuts",
        "Seeds"
      ]
    },
    {
      "nutrient": "Complex Carbohydrates",
      "reason": "Provide sustained energy and support weight gain through calorie surplus.",
      "sources": [
        "Quinoa",
        "Sweet Potatoes",
        "Black Beans",
        "Corn Tortillas",
        "Oats"
      ]
    },
    {
      "nutrient": "Healthy Fats",
      "reason": "Important for hormone production, energy storage, and overall health. Contribute to calorie surplus for weight gain.",
      "sources": [
        "Avocado",
        "Nuts",
        "Seeds",
        "Olive Oil"
      ]
    }
  ],
  "avoidList": [
    {
      "food": "Empty Calories (Processed Foods, Sugary Drinks)",
      "reason": "Provide minimal nutritional value and can hinder healthy weight gain."
    }
  ],
  "weeklyHabitTips": [
    "Eat frequent meals and snacks throughout the day.",
    "Prioritize protein and complex carbohydrates in each meal.",
    "Track your calorie intake to ensure you are in a surplus.",
    "Incorporate strength training exercises to build muscle mass."
  ]
}