{
  "dailyPlan": {
    "breakfast": {
      "name": "Creamy Polenta with Roasted Vegetables",
      "ingredients": [
        "Polenta (cornmeal)",
        "Vegetable broth",
        "Nutritional yeast",
        "Olive oil",
        "Assorted roasted vegetables (e.g., bell peppers, zucchini, eggplant)",
        "Fresh basil",
        "Salt",
        "Pepper"
      ],
      "preparation": "Cook polenta according to package directions using vegetable broth. Stir in nutritional yeast for cheesy flavor. Roast vegetables with olive oil, salt, and pepper until tender. Top polenta with roasted vegetables and fresh basil.",
      "nutritionalBenefits": "Provides complex carbohydrates for energy, fiber for digestion, and vitamins and minerals from vegetables.  Polenta is easily digestible and gentle on the liver.",
      "healthNotes": "Choose low-sodium vegetable broth to reduce sodium intake.  Roasting vegetables enhances their sweetness and digestibility."
    },
    "lunch": {
      "name": "Lentil Bolognese with Whole Wheat Pasta",
      "ingredients": [
        "Whole wheat pasta",
        "Brown or green lentils",
        "Crushed tomatoes",
        "Vegetable broth",
        "Onion",
        "Garlic",
        "Carrot",
        "Celery",
        "Olive oil",
        "Italian herbs (oregano, basil, thyme)",
        "Salt",
        "Pepper"
      ],
      "preparation": "Cook pasta according to package directions. Sauté onion, garlic, carrot, and celery in olive oil. Add lentils, crushed tomatoes, vegetable broth, and Italian herbs. Simmer until lentils are tender. Season with salt and pepper. Serve lentil bolognese over pasta.",
      "nutritionalBenefits": "High in protein and fiber from lentils, provides complex carbohydrates from pasta, and rich in antioxidants from tomatoes and herbs.  Lentils are a good source of iron, which is important for vegans. Easily digestible.",
      "healthNotes": "Limit the amount of olive oil used. Use whole wheat pasta to increase fiber intake."
    },
    "dinner": {
      "name": "Vegan Risotto with Asparagus and Peas",
      "ingredients": [
        "Arborio rice",
        "Vegetable broth",
        "White wine (optional, alcohol should evaporate during cooking)",
        "Asparagus",
        "Peas",
        "Onion",
        "Garlic",
        "Nutritional yeast",
        "Olive oil",
        "Salt",
        "Pepper"
      ],
      "preparation": "Sauté onion and garlic in olive oil. Add Arborio rice and toast lightly. Deglaze with white wine (if using). Gradually add vegetable broth, stirring constantly, until rice is creamy and cooked through. Stir in asparagus, peas, and nutritional yeast. Season with salt and pepper. ",
      "nutritionalBenefits": "Provides carbohydrates for energy, vitamins and minerals from asparagus and peas, and a creamy texture from the Arborio rice.  This is a filling meal that is easy on the digestive system.",
      "healthNotes": "Using a good quality vegetable broth is important for flavor.  Cook the risotto slowly and patiently for the best results. The use of alcohol is optional and can be omitted."
    },
    "snacks": [
      {
        "name": "Almond Milk Smoothie with Banana and Spinach",
        "ingredients": [
          "Almond milk",
          "Banana",
          "Spinach",
          "Chia seeds",
          "Plant-based protein powder (optional)"
        ],
        "preparation": "Blend all ingredients together until smooth.",
        "nutritionalBenefits": "Provides protein, fiber, and vitamins and minerals.  The smoothie is quick, easily digested, and packed with nutrients.",
        "healthNotes": "Adjust the amount of almond milk to achieve desired consistency. Ensure the protein powder is liver-friendly, avoiding high doses of additives and artificial sweeteners."
      }
    ]
  },
  "nutritionalFocus": [
    {
      "nutrient": "Protein",
      "reason": "Essential for muscle building and repair, especially crucial for weight gain. Important for liver health and regeneration.",
      "sources": [
        "Lentils",
        "Beans",
        "Tofu",
        "Tempeh",
        "Plant-based protein powder",
        "Nuts",
        "Seeds",
        "Nutritional Yeast"
      ]
    },
    {
      "nutrient": "Complex Carbohydrates",
      "reason": "Provide sustained energy for weight gain and are easily digestible. Important for fuel and liver function.",
      "sources": [
        "Whole wheat pasta",
        "Brown rice",
        "Polenta",
        "Quinoa",
        "Potatoes",
        "Sweet potatoes"
      ]
    },
    {
      "nutrient": "Healthy Fats",
      "reason": "Important for hormone production, cell function, and calorie intake for weight gain. Good for liver function when consumed in moderate amounts.",
      "sources": [
        "Olive oil",
        "Avocado",
        "Nuts",
        "Seeds"
      ]
    },
    {
      "nutrient": "Fiber",
      "reason": "Promotes digestive health and helps regulate blood sugar levels. Essential for gut health, which has a secondary role in liver health",
      "sources": [
        "Fruits",
        "Vegetables",
        "Whole grains",
        "Legumes",
        "Nuts",
        "Seeds"
      ]
    }
  ],
  "avoidList": [
    {
      "food": "Excessive Sugar",
      "reason": "Can contribute to fatty liver disease and inflammation, further stressing the liver."
    },
    {
      "food": "Processed Foods",
      "reason": "Often high in unhealthy fats, sodium, and additives that can be harmful to the liver."
    },
    {
      "food": "Alcohol",
      "reason": "Highly toxic to the liver and should be completely avoided with liver disease."
    },
    {
      "food": "Excessive Salt",
      "reason": "Can contribute to fluid retention and stress the liver."
    },
    {
      "food": "High-Fat Fried Foods",
      "reason": "Difficult to digest and can contribute to fatty liver disease."
    }
  ],
  "weeklyHabitTips": [
    "Eat smaller, more frequent meals to aid digestion and nutrient absorption.",
    "Stay hydrated by drinking plenty of water throughout the day.",
    "Focus on whole, unprocessed foods to support liver health.",
    "Incorporate moderate exercise into your routine to improve overall health.",
    "Consult with a registered dietitian or healthcare professional for personalized dietary advice."
  ]
}