{
  "dailyPlan": {
    "breakfast": {
      "name": "Labneh with Za'atar and Whole Wheat Pita",
      "ingredients": [
        "Labneh (strained yogurt)",
        "Za'atar spice blend",
        "Olive oil",
        "Whole wheat pita bread",
        "Cucumber slices",
        "Tomato slices"
      ],
      "preparation": "Spread labneh on a plate, drizzle with olive oil, and sprinkle with za'atar. Serve with whole wheat pita, cucumber, and tomato slices.",
      "nutritionalBenefits": "Labneh provides protein and probiotics. Za'atar contains antioxidants. Whole wheat pita offers fiber.",
      "healthNotes": "The probiotics in labneh are generally beneficial, though consult with a doctor about liver considerations. Choose low-sodium za'atar blends."
    },
    "lunch": {
      "name": "Mujadara (Lentils and Rice with Caramelized Onions)",
      "ingredients": [
        "Brown or green lentils",
        "Basmati rice",
        "Onions",
        "Olive oil",
        "Cumin",
        "Coriander",
        "Salt",
        "Pepper",
        "Vegetable broth"
      ],
      "preparation": "Caramelize onions in olive oil. Cook lentils and rice in vegetable broth with cumin and coriander. Combine caramelized onions with the lentil and rice mixture. Season with salt and pepper.",
      "nutritionalBenefits": "Mujadara is a good source of protein, fiber, and complex carbohydrates. Lentils provide iron.",
      "healthNotes": "Control the oil used in caramelizing the onions to manage fat intake. Ensure the salt content is low to support liver health."
    },
    "dinner": {
      "name": "Vegetable Tagine with Chickpeas and Couscous",
      "ingredients": [
        "Chickpeas (canned or cooked)",
        "Carrots",
        "Zucchini",
        "Eggplant",
        "Bell peppers",
        "Onions",
        "Garlic",
        "Ginger",
        "Cumin",
        "Turmeric",
        "Cinnamon",
        "Vegetable broth",
        "Couscous",
        "Dried apricots",
        "Almonds (slivered)"
      ],
      "preparation": "Sauté onions, garlic, and ginger. Add carrots, zucchini, eggplant, and bell peppers. Season with cumin, turmeric, and cinnamon. Add chickpeas and vegetable broth and simmer until vegetables are tender. Prepare couscous according to package instructions. Top the tagine with dried apricots and almonds. Serve with couscous.",
      "nutritionalBenefits": "Provides a variety of vitamins, minerals, and fiber. Chickpeas are a good source of protein and fiber. Turmeric is an anti-inflammatory.",
      "healthNotes": "Use low-sodium vegetable broth and be mindful of salt. Smaller portions can help manage overall calorie intake. Consult with a doctor regarding the use of turmeric with liver disease."
    },
    "snacks": [
      {
        "name": "Dates with Almond Butter",
        "ingredients": [
          "Dates (Medjool or other)",
          "Almond butter"
        ],
        "preparation": "Stuff each date with a small amount of almond butter.",
        "nutritionalBenefits": "Dates provide natural sugars and fiber. Almond butter offers healthy fats and protein.",
        "healthNotes": "Dates are high in sugar, so limit portion size. Choose almond butter without added sugar or salt."
      }
    ]
  },
  "nutritionalFocus": [
    {
      "nutrient": "Fiber",
      "reason": "Promotes healthy digestion, supports liver function, and helps regulate blood sugar levels.",
      "sources": [
        "Lentils",
        "Chickpeas",
        "Whole wheat pita",
        "Vegetables",
        "Fruits"
      ]
    },
    {
      "nutrient": "Protein",
      "reason": "Essential for cell repair and function, supports overall health, and helps with satiety.",
      "sources": [
        "Labneh",
        "Lentils",
        "Chickpeas",
        "Almond butter"
      ]
    },
    {
      "nutrient": "Antioxidants",
      "reason": "Help protect the body from damage caused by free radicals, supporting liver health.",
      "sources": [
        "Za'atar",
        "Turmeric",
        "Fruits",
        "Vegetables"
      ]
    }
  ],
  "avoidList": [
    {
      "food": "High-Sodium Foods",
      "reason": "Sodium can worsen fluid retention and increase blood pressure, both of which can negatively impact liver health."
    },
    {
      "food": "Excessive Added Sugars",
      "reason": "Excess sugar intake can contribute to fatty liver disease."
    },
    {
      "food": "Processed Foods",
      "reason": "Often high in sodium, unhealthy fats, and additives that can burden the liver."
    }
  ],
  "weeklyHabitTips": [
    "Drink plenty of water throughout the day to stay hydrated and support liver function.",
    "Engage in gentle exercise, such as walking or yoga, to improve circulation and reduce stress.",
    "Practice mindful eating to improve digestion and prevent overeating.",
    "Establish a regular sleep schedule to promote restful sleep.",
    "Consult with a registered dietitian or healthcare professional for personalized dietary guidance tailored to your specific liver condition."
  ]
}