{
  "dailyPlan": {
    "breakfast": {
      "name": "Breakfast Burrito (Egg-Free)",
      "ingredients": [
        "Whole wheat tortilla",
        "Black beans",
        "Shredded cheese (Monterey Jack or similar)",
        "Salsa",
        "Avocado",
        "Cooked diced potatoes",
        "Plant-based sausage"
      ],
      "preparation": "Warm tortilla. Fill with black beans, cheese, salsa, avocado, potatoes, and plant-based sausage. Roll up and enjoy.",
      "nutritionalBenefits": "Provides protein, fiber, healthy fats, and carbohydrates for sustained energy. Rich in vitamins and minerals.",
      "healthNotes": "Choose low-sodium black beans and salsa to manage blood pressure. Opt for whole wheat tortillas for added fiber."
    },
    "lunch": {
      "name": "Chicken Fajita Salad",
      "ingredients": [
        "Grilled chicken breast (skinless)",
        "Bell peppers (various colors)",
        "Onion",
        "Romaine lettuce",
        "Avocado",
        "Cherry tomatoes",
        "Lime juice",
        "Olive oil",
        "Cilantro"
      ],
      "preparation": "Grill chicken breast with fajita seasoning. Sauté bell peppers and onion. Combine romaine lettuce, avocado, cherry tomatoes, and grilled chicken and vegetables in a bowl. Dress with lime juice, olive oil, and chopped cilantro.",
      "nutritionalBenefits": "Lean protein, vitamins, minerals, and healthy fats. Provides antioxidants from colorful vegetables.",
      "healthNotes": "Use lean chicken breast and limit olive oil to control fat intake. High in protein to help with weight gain."
    },
    "dinner": {
      "name": "Vegetarian Chili with Cornbread",
      "ingredients": [
        "Kidney beans",
        "Pinto beans",
        "Diced tomatoes",
        "Corn",
        "Onion",
        "Garlic",
        "Chili powder",
        "Cumin",
        "Vegetable broth",
        "Cornmeal",
        "Flour",
        "Baking powder",
        "Milk (dairy or non-dairy)",
        "Vegetable oil"
      ],
      "preparation": "Sauté onion and garlic. Add beans, diced tomatoes, corn, chili powder, cumin, and vegetable broth. Simmer for 20-30 minutes. Prepare cornbread according to recipe (using milk and vegetable oil). Serve chili with a slice of cornbread.",
      "nutritionalBenefits": "Excellent source of fiber, protein, and complex carbohydrates. Cornbread provides additional calories and carbohydrates for weight gain.",
      "healthNotes": "Choose low-sodium beans and tomatoes. Limit salt added to chili. Cornbread provides needed energy for weight gain but should be consumed in moderation, with a focus on homemade options to control ingredients."
    },
    "snacks": [
      {
        "name": "Greek Yogurt with Berries and Nuts",
        "ingredients": [
          "Greek yogurt (full-fat or low-fat)",
          "Mixed berries (strawberries, blueberries, raspberries)",
          "Almonds or walnuts"
        ],
        "preparation": "Combine Greek yogurt, mixed berries, and nuts in a bowl.",
        "nutritionalBenefits": "High in protein, calcium, and antioxidants. Nuts provide healthy fats and calories for weight gain.",
        "healthNotes": "Choose full-fat Greek yogurt for additional calories if needed. Watch portion sizes of nuts to manage overall fat intake. Full fat options should be balanced with reduced fat or low fat in other meals to help keep cholesterol in check."
      }
    ]
  },
  "nutritionalFocus": [
    {
      "nutrient": "Protein",
      "reason": "Essential for muscle building and repair, crucial for healthy weight gain.",
      "sources": [
        "Chicken",
        "Black beans",
        "Greek yogurt",
        "Nuts",
        "Plant-based sausage"
      ]
    },
    {
      "nutrient": "Complex Carbohydrates",
      "reason": "Provide sustained energy for daily activities and support weight gain.",
      "sources": [
        "Whole wheat tortillas",
        "Cornbread",
        "Beans",
        "Potatoes",
        "Corn"
      ]
    },
    {
      "nutrient": "Healthy Fats",
      "reason": "Contribute to overall health, hormone production, and calorie intake for weight gain.",
      "sources": [
        "Avocado",
        "Olive oil",
        "Nuts",
        "Full fat Greek Yogurt (in moderation)"
      ]
    }
  ],
  "avoidList": [
    {
      "food": "Duck",
      "reason": "Personal preference."
    },
    {
      "food": "Eggs",
      "reason": "Allergy."
    },
    {
      "food": "High Fructose Corn Syrup",
      "reason": "Avoid added sugars that can negatively affect the liver."
    }
  ],
  "weeklyHabitTips": [
    "Eat 5-6 small meals per day instead of 3 large ones to help with calorie intake.",
    "Incorporate resistance training 2-3 times per week to build muscle mass.",
    "Track your calorie intake to ensure you are consuming enough calories for weight gain.",
    "Drink plenty of water throughout the day to support overall health and digestion.",
    "Consult with a doctor or registered dietitian for personalized advice on managing your liver condition and achieving your weight gain goals."
  ]
}