{
  "dailyPlan": {
    "breakfast": {
      "name": "Vegan Breakfast Burrito",
      "ingredients": [
        "Whole wheat tortilla",
        "Black beans",
        "Scrambled tofu (turmeric for color)",
        "Salsa",
        "Avocado",
        "Spinach"
      ],
      "preparation": "Sauté tofu with turmeric and black salt for an egg-like flavor. Warm the tortilla. Fill with tofu, beans, salsa, avocado, and spinach. Wrap and serve.",
      "nutritionalBenefits": "High in protein, fiber, and healthy fats. Provides sustained energy for the morning.",
      "healthNotes": "Tofu provides protein and can be easier on the liver than some animal proteins. Use low-sodium salsa to manage sodium intake, crucial for liver health."
    },
    "lunch": {
      "name": "Vegan Mexican Quinoa Bowl",
      "ingredients": [
        "Cooked quinoa",
        "Black beans",
        "Corn",
        "Diced bell peppers (red and yellow)",
        "Avocado",
        "Chopped cilantro",
        "Lime juice",
        "Olive oil",
        "Spices (cumin, chili powder, garlic powder)"
      ],
      "preparation": "Combine all ingredients in a bowl. Dress with lime juice, olive oil, and spices. Adjust seasoning to taste.",
      "nutritionalBenefits": "Complete protein source from quinoa, good source of fiber, and provides essential vitamins and minerals.",
      "healthNotes": "Quinoa is gentle on the digestive system and provides sustained energy. Be mindful of spice levels, avoiding excessive heat that might irritate the digestive system. Use fresh, whole ingredients to minimize processed food intake."
    },
    "dinner": {
      "name": "Vegan Enchiladas with Sweet Potato and Black Beans",
      "ingredients": [
        "Corn tortillas",
        "Cooked sweet potato, mashed",
        "Black beans",
        "Vegan enchilada sauce (homemade or low-sodium)",
        "Vegan cheese alternative (optional)",
        "Chopped onion",
        "Spices (chili powder, cumin)"
      ],
      "preparation": "Sauté onion. Mix mashed sweet potato, black beans, sautéed onion, and spices. Fill each tortilla with the mixture, roll them up, and place in a baking dish. Cover with enchilada sauce and vegan cheese (optional). Bake until heated through and cheese is melted (if using).",
      "nutritionalBenefits": "Rich in fiber, complex carbohydrates, and vitamins A and C. Provides a satisfying and nutritious meal.",
      "healthNotes": "Sweet potatoes are easily digested. Use low-sodium enchilada sauce or make your own to control sodium intake, important for liver health. Ensure the enchilada sauce is free from any ingredients known to be harmful for liver disease."
    },
    "snacks": [
      {
        "name": "Avocado Toast with a sprinkle of nutritional yeast",
        "ingredients": [
          "Whole grain toast",
          "Avocado, mashed",
          "Nutritional yeast",
          "Hemp seeds"
        ],
        "preparation": "Toast the bread. Spread mashed avocado on top. Sprinkle with nutritional yeast and hemp seeds.",
        "nutritionalBenefits": "Healthy fats, fiber, B vitamins, and protein. Keeps you feeling full and satisfied between meals.",
        "healthNotes": "Avocados are rich in healthy fats that are beneficial for overall health, but monitor portion sizes due to their caloric density. Nutritional yeast provides B vitamins and a cheesy flavor without dairy. Hemp seeds add extra protein."
      }
    ]
  },
  "nutritionalFocus": [
    {
      "nutrient": "Protein",
      "reason": "Essential for growth, repair, and muscle building. Important for healthy weight gain.",
      "sources": [
        "Tofu",
        "Black beans",
        "Quinoa",
        "Hemp seeds"
      ]
    },
    {
      "nutrient": "Complex Carbohydrates",
      "reason": "Provides sustained energy and fiber for healthy digestion and supports weight gain.",
      "sources": [
        "Quinoa",
        "Sweet potato",
        "Whole wheat tortillas",
        "Corn"
      ]
    },
    {
      "nutrient": "Healthy Fats",
      "reason": "Supports hormone production, brain function, and nutrient absorption. Important for overall health and weight gain.",
      "sources": [
        "Avocado",
        "Olive oil",
        "Hemp seeds"
      ]
    },
    {
      "nutrient": "B Vitamins",
      "reason": "Important for energy metabolism and nerve function. Critical for individuals with liver disease.",
      "sources": [
        "Nutritional Yeast",
        "Whole Grains",
        "Legumes"
      ]
    }
  ],
  "avoidList": [
    {
      "food": "Eggs",
      "reason": "Allergy"
    },
    {
      "food": "High Fructose Corn Syrup",
      "reason": "Can be damaging to the liver"
    },
    {
      "food": "Excessive Processed Foods",
      "reason": "Can contain additives and preservatives harmful to the liver."
    },
    {
      "food": "Alcohol",
      "reason": "Damaging to the liver."
    },
    {
      "food": "High-Sodium Foods",
      "reason": "Can contribute to fluid retention and liver stress."
    }
  ],
  "weeklyHabitTips": [
    "Eat consistently throughout the day to support healthy weight gain.",
    "Choose whole, unprocessed foods whenever possible to support liver health.",
    "Stay hydrated by drinking plenty of water throughout the day. Water helps the liver function more effectively.",
    "Incorporate light exercise, like walking, to improve overall health and well-being.",
    "Consult with a registered dietitian or healthcare professional for personalized guidance on weight gain and managing liver disease."
  ]
}
