{
  "dailyPlan": {
    "breakfast": {
      "name": "Mashed Banana with Plant-Based Milk",
      "ingredients": [
        "1/4 of a ripe banana",
        "20ml plant-based milk (unsweetened almond or soy)",
        "Pinch of cinnamon (optional)"
      ],
      "preparation": "Mash the banana thoroughly. Mix in the plant-based milk until it reaches a smooth, slightly liquid consistency. Sprinkle with cinnamon if desired.",
      "nutritionalBenefits": "Provides easily digestible carbohydrates, potassium, and a small amount of calcium and vitamins. The softness is appropriate for someone of this size.",
      "healthNotes": "Extremely small portions are necessary given the user's weight. This is just to provide a tiny amount of nutrition. Monitor for any digestive issues."
    },
    "lunch": {
      "name": "Pureed Sweet Potato",
      "ingredients": [
        "10g cooked sweet potato",
        "10ml water"
      ],
      "preparation": "Steam or bake a small amount of sweet potato until very soft. Puree the sweet potato with the water until smooth.",
      "nutritionalBenefits": "Provides Vitamin A, fiber, and antioxidants. Easy to digest.",
      "healthNotes": "Extremely small portion due to weight. Monitor stool consistency."
    },
    "dinner": {
      "name": "Rice Cereal Porridge (Plain)",
      "ingredients": [
        "5g rice cereal (unfortified)",
        "20ml water"
      ],
      "preparation": "Cook rice cereal with water according to package directions, ensuring it forms a smooth, lump-free porridge. Cool slightly before serving.",
      "nutritionalBenefits": "Easily digestible carbohydrates and provides some energy.",
      "healthNotes": "Choose unfortified rice cereal to minimize potential reactions. Observe for any signs of allergy or intolerance."
    },
    "snacks": [
      {
        "name": "Small amount of unsweetened applesauce",
        "ingredients": [
          "5g unsweetened applesauce"
        ],
        "preparation": "Serve a small spoonful of unsweetened applesauce.",
        "nutritionalBenefits": "Provides Vitamin C and fiber.",
        "healthNotes": "Ensure applesauce is smooth and easily digestible. Monitor for gas or bloating."
      }
    ]
  },
  "nutritionalFocus": [
    {
      "nutrient": "Calories",
      "reason": "Crucial for energy and growth, though extremely limited by the user's weight. Small, frequent feedings are likely needed under professional medical guidance.",
      "sources": [
        "Bananas",
        "Sweet Potato",
        "Rice Cereal",
        "Applesauce"
      ]
    },
    {
      "nutrient": "Hydration",
      "reason": "Essential for all bodily functions. Monitor fluid intake closely.",
      "sources": [
        "Plant-based milk",
        "Water in purees"
      ]
    },
    {
      "nutrient": "Vitamin A",
      "reason": "Important for vision, immune function, and cell growth. Provided by sweet potato",
      "sources": [
        "Sweet Potato"
      ]
    }
  ],
  "avoidList": [
    {
      "food": "Large portions",
      "reason": "Given the user's extremely low weight, even slightly larger portions could be detrimental."
    },
    {
      "food": "Highly processed foods",
      "reason": "Difficult to digest and may contain additives that are not suitable for the user's system."
    }
  ],
  "weeklyHabitTips": [
    "Consult a pediatrician or registered dietitian immediately for a comprehensive feeding plan.",
    "Introduce new foods slowly and one at a time, observing for any reactions.",
    "Monitor weight gain and overall health closely, documenting any changes.",
    "Maintain a sterile preparation environment to prevent infections.",
    "Ensure all foods are properly pureed or mashed to prevent choking hazards."
  ]
}