{
  "dailyPlan": {
    "breakfast": {
      "name": "Vegan Polenta with Roasted Vegetables",
      "ingredients": [
        "Polenta (coarse ground)",
        "Vegetable broth",
        "Cherry tomatoes",
        "Bell peppers (red, yellow)",
        "Zucchini",
        "Onion",
        "Garlic",
        "Olive oil",
        "Fresh basil",
        "Nutritional yeast (optional)",
        "Salt and pepper"
      ],
      "preparation": "Cook polenta according to package directions using vegetable broth. Roast chopped vegetables with olive oil, garlic, salt, and pepper until tender. Top polenta with roasted vegetables and fresh basil. Sprinkle with nutritional yeast if desired.",
      "nutritionalBenefits": "Provides complex carbohydrates, fiber, vitamins, and antioxidants. Good source of energy for weight gain.",
      "healthNotes": "Easy to digest. Choose gluten-free polenta if necessary. Roasting vegetables enhances their flavor and digestibility, important for liver health."
    },
    "lunch": {
      "name": "Lentil Bolognese with Whole Wheat Pasta",
      "ingredients": [
        "Whole wheat pasta",
        "Green lentils",
        "Canned crushed tomatoes",
        "Onion",
        "Carrot",
        "Celery",
        "Garlic",
        "Olive oil",
        "Vegetable broth",
        "Dried oregano",
        "Dried basil",
        "Bay leaf",
        "Salt and pepper",
        "Nutritional yeast (optional)"
      ],
      "preparation": "Sauté onion, carrot, and celery in olive oil. Add garlic and lentils and cook for a few minutes. Stir in crushed tomatoes, vegetable broth, oregano, basil, bay leaf, salt, and pepper. Simmer until lentils are tender. Cook pasta according to package directions. Serve lentil bolognese over pasta. Sprinkle with nutritional yeast if desired.",
      "nutritionalBenefits": "Rich in protein, fiber, and iron. Provides sustained energy release and promotes muscle growth. Whole wheat pasta adds complex carbohydrates.",
      "healthNotes": "Lentils are a good source of plant-based protein and are generally well-tolerated. Avoid adding excessive amounts of oil.  This meal is helpful for liver health as it's rich in fiber which helps detoxify the body."
    },
    "dinner": {
      "name": "Vegan Mushroom Risotto",
      "ingredients": [
        "Arborio rice",
        "Mixed mushrooms (cremini, shiitake, oyster)",
        "Vegetable broth",
        "Onion",
        "Garlic",
        "Olive oil",
        "White wine (optional)",
        "Vegan Parmesan cheese (optional)",
        "Fresh parsley",
        "Salt and pepper"
      ],
      "preparation": "Sauté onion and garlic in olive oil. Add rice and cook for a minute. Add white wine (if using) and let it evaporate. Gradually add warm vegetable broth, stirring constantly, until rice is creamy and cooked through. Sauté mushrooms in olive oil until tender. Stir mushrooms into risotto. Garnish with vegan parmesan cheese and fresh parsley. Season with salt and pepper.",
      "nutritionalBenefits": "Provides carbohydrates for energy and essential nutrients from mushrooms. Offers a satisfying and flavorful meal.",
      "healthNotes": "Ensure the rice is cooked thoroughly.  Use low-sodium vegetable broth to minimize sodium intake, which is important for maintaining liver health. The mushrooms also add valuable nutrients"
    },
    "snacks": [
      {
        "name": "Avocado Toast with Hemp Seeds",
        "ingredients": [
          "Whole grain bread",
          "Avocado",
          "Hemp seeds",
          "Lemon juice",
          "Salt and pepper"
        ],
        "preparation": "Toast bread. Mash avocado with lemon juice, salt, and pepper. Spread avocado on toast and sprinkle with hemp seeds.",
        "nutritionalBenefits": "Healthy fats, protein, and fiber. Provides a quick energy boost.",
        "healthNotes": "Avocado is a good source of healthy fats. Hemp seeds provide protein and omega-3 fatty acids."
      }
    ]
  },
  "nutritionalFocus": [
    {
      "nutrient": "Protein",
      "reason": "Essential for muscle growth and repair, crucial for weight gain.",
      "sources": [
        "Lentils",
        "Tofu",
        "Tempeh",
        "Hemp seeds",
        "Chia seeds",
        "Nutritional yeast"
      ]
    },
    {
      "nutrient": "Complex Carbohydrates",
      "reason": "Provide sustained energy release for weight gain and physical activity.",
      "sources": [
        "Whole wheat pasta",
        "Brown rice",
        "Quinoa",
        "Oats",
        "Polenta",
        "Sweet potatoes"
      ]
    },
    {
      "nutrient": "Healthy Fats",
      "reason": "Important for hormone production, energy storage, and overall health. Aids nutrient absorption.",
      "sources": [
        "Avocado",
        "Olive oil",
        "Nuts",
        "Seeds",
        "Nut butters"
      ]
    }
  ],
  "avoidList": [
    {
      "food": "Processed Foods",
      "reason": "Often high in unhealthy fats, sodium, and added sugars, which can negatively impact liver health and overall weight gain goals."
    },
    {
      "food": "Excessive Sugar",
      "reason": "Can contribute to liver inflammation and hinder weight gain in a healthy manner."
    },
    {
      "food": "Alcohol",
      "reason": "Extremely harmful to the liver, especially with existing liver disease. Should be completely avoided."
    },
    {
      "food": "Saturated and Trans Fats",
      "reason": "Can worsen liver health issues. Found in fried foods and some processed vegan products. Focus on unsaturated fats."
    }
  ],
  "weeklyHabitTips": [
    "Eat small, frequent meals throughout the day to increase calorie intake without overwhelming the digestive system.",
    "Incorporate healthy fats into every meal to boost calorie density.",
    "Track your calorie intake to ensure you are consistently consuming enough calories for weight gain.",
    "Prioritize rest and recovery to allow your body to rebuild muscle tissue.",
    "Consider consulting a registered dietitian or nutritionist for personalized guidance."
  ]
}