{
  "dailyPlan": {
    "breakfast": {
      "name": "Mexican Tofu Scramble Breakfast Burrito",
      "ingredients": [
        "Tofu (firm or extra-firm)",
        "Black beans",
        "Corn",
        "Red onion",
        "Bell pepper (any color)",
        "Salsa",
        "Avocado",
        "Whole wheat tortillas",
        "Spices (cumin, chili powder, garlic powder, smoked paprika)",
        "Olive oil"
      ],
      "preparation": "Crumble tofu and sauté with chopped onion and bell pepper in olive oil. Add black beans, corn, and spices. Cook until heated through. Warm tortillas. Fill each tortilla with tofu scramble, salsa, and avocado. Fold into a burrito.",
      "nutritionalBenefits": "High in protein and fiber to support muscle growth and energy. Provides essential vitamins and minerals. Avocado contributes healthy fats.",
      "healthNotes": "Tofu is a great source of plant-based protein. Adjust spices to your preference. Choose whole wheat tortillas for added fiber."
    },
    "lunch": {
      "name": "Vegetarian Quesadilla with Black Beans and Sweet Potatoes",
      "ingredients": [
        "Whole wheat tortillas",
        "Black beans",
        "Sweet potato (roasted and cubed)",
        "Cheddar cheese (or vegan cheese alternative)",
        "Salsa",
        "Sour cream (or vegan sour cream alternative)",
        "Avocado",
        "Olive oil",
        "Spices (chili powder, cumin)"
      ],
      "preparation": "Spread a thin layer of olive oil on a tortilla. Layer black beans, roasted sweet potato, and cheese. Top with another tortilla. Cook in a skillet or panini press until cheese is melted and tortillas are golden brown. Serve with salsa, sour cream, and avocado.",
      "nutritionalBenefits": "Provides a good balance of carbohydrates, protein, and healthy fats. Sweet potatoes are a good source of Vitamin A and fiber.",
      "healthNotes": "Roasting sweet potatoes ahead of time can save time. Use a low-fat cheese option if desired. Add spinach or kale for extra nutrients."
    },
    "dinner": {
      "name": "Mexican Vegetarian Enchiladas with Rice and Beans",
      "ingredients": [
        "Corn tortillas",
        "Black beans",
        "Corn",
        "Onion",
        "Bell pepper",
        "Enchilada sauce",
        "Cheddar cheese (or vegan cheese alternative)",
        "Brown rice",
        "Refried beans",
        "Olive oil",
        "Spices (chili powder, cumin, garlic powder)"
      ],
      "preparation": "Sauté chopped onion and bell pepper in olive oil. Add black beans, corn, and spices. Fill each corn tortilla with the bean and vegetable mixture. Roll up tortillas and place in a baking dish. Pour enchilada sauce over the tortillas and top with cheese. Bake until cheese is melted and bubbly. Serve with brown rice and refried beans.",
      "nutritionalBenefits": "Provides a good source of complex carbohydrates, protein, and fiber. Enchilada sauce adds flavor and some nutrients.",
      "healthNotes": "Use a low-sodium enchilada sauce. Add vegetables like zucchini or mushrooms to the filling. Brown rice is a healthier alternative to white rice."
    },
    "snacks": [
      {
        "name": "Greek Yogurt with Granola and Berries",
        "ingredients": [
          "Greek yogurt (full-fat or low-fat)",
          "Granola",
          "Berries (blueberries, raspberries, strawberries - not starberry)",
          "Honey (optional)"
        ],
        "preparation": "Layer Greek yogurt, granola, and berries in a bowl. Drizzle with honey if desired.",
        "nutritionalBenefits": "Provides protein, calcium, probiotics, and antioxidants. Granola adds fiber and healthy fats.",
        "healthNotes": "Choose a low-sugar granola. Use plain Greek yogurt to avoid added sugar. Berries contribute antioxidants and vitamins. Full-fat greek yogurt can help with satiety."
      }
    ]
  },
  "nutritionalFocus": [
    {
      "nutrient": "Protein",
      "reason": "Essential for muscle growth and repair to support healthy weight gain. Also important for feeling full and satisfied.",
      "sources": [
        "Tofu",
        "Black beans",
        "Greek yogurt",
        "Cheese",
        "Nuts and seeds"
      ]
    },
    {
      "nutrient": "Complex Carbohydrates",
      "reason": "Provide sustained energy for daily activities and muscle building. Important for fueling workouts.",
      "sources": [
        "Whole wheat tortillas",
        "Brown rice",
        "Sweet potatoes",
        "Black beans",
        "Corn"
      ]
    },
    {
      "nutrient": "Healthy Fats",
      "reason": "Essential for hormone production, brain function, and overall health. Also helps with satiety and absorption of fat-soluble vitamins.",
      "sources": [
        "Avocado",
        "Nuts and seeds",
        "Olive oil",
        "Full-fat Greek yogurt"
      ]
    }
  ],
  "avoidList": [
    {
      "food": "Starberry",
      "reason": "User Preference"
    }
  ],
  "weeklyHabitTips": [
    "Increase portion sizes slightly to promote weight gain.",
    "Incorporate strength training exercises 2-3 times per week to build muscle mass.",
    "Drink plenty of water throughout the day to stay hydrated.",
    "Add healthy fats to your meals and snacks (e.g., nuts, seeds, avocado).",
    "Ensure adequate sleep to support muscle recovery and overall health."
  ]
}