{
  "dailyPlan": {
    "breakfast": {
      "name": "Ricotta and Spinach Frittata with Whole Wheat Toast",
      "ingredients": [
        "Eggs",
        "Ricotta cheese",
        "Spinach",
        "Onion",
        "Garlic",
        "Olive oil",
        "Whole wheat toast",
        "Salt",
        "Pepper"
      ],
      "preparation": "Sauté onion and garlic. Add spinach and cook until wilted. Whisk eggs with ricotta, salt, and pepper. Pour egg mixture over spinach. Cook on stovetop until edges set. Transfer to oven and bake until set. Serve with whole wheat toast.",
      "nutritionalBenefits": "High in protein from eggs and ricotta, iron from spinach, and fiber from whole wheat toast.",
      "healthNotes": "Provides sustained energy for the morning and helps with muscle building due to the high protein content."
    },
    "lunch": {
      "name": "Lentil Bolognese with Whole Wheat Pasta",
      "ingredients": [
        "Brown or Green Lentils",
        "Whole wheat pasta",
        "Crushed tomatoes",
        "Onion",
        "Carrots",
        "Celery",
        "Garlic",
        "Vegetable broth",
        "Olive oil",
        "Italian herbs",
        "Parmesan cheese (optional, for topping)"
      ],
      "preparation": "Sauté onion, carrots, and celery. Add garlic and cook until fragrant. Add lentils, crushed tomatoes, vegetable broth, and Italian herbs. Simmer until lentils are tender. Cook whole wheat pasta according to package directions. Serve lentil bolognese over pasta. Sprinkle with parmesan cheese if desired.",
      "nutritionalBenefits": "Excellent source of protein and fiber from lentils and pasta. Rich in vitamins and minerals from vegetables.",
      "healthNotes": "Provides sustained energy for the afternoon, supports muscle building, and promotes healthy digestion."
    },
    "dinner": {
      "name": "Vegetarian Pizza with Roasted Vegetables",
      "ingredients": [
        "Whole wheat pizza dough",
        "Pizza sauce",
        "Mozzarella cheese",
        "Roasted vegetables (bell peppers, zucchini, eggplant, onions)",
        "Olive oil",
        "Italian seasoning"
      ],
      "preparation": "Preheat oven and pizza stone (if using). Roll out pizza dough. Spread pizza sauce over dough. Sprinkle with mozzarella cheese. Top with roasted vegetables. Drizzle with olive oil and sprinkle with Italian seasoning. Bake until crust is golden brown and cheese is melted and bubbly.",
      "nutritionalBenefits": "Provides a good source of complex carbohydrates and fiber from the whole wheat dough and variety of vitamins and minerals from the vegetables.",
      "healthNotes": "Choose a low-sodium pizza sauce. This dinner offers flexibility in the choice of toppings, tailor it to your preferences."
    },
    "snacks": [
      {
        "name": "Greek Yogurt with Berries and Almonds",
        "ingredients": [
          "Greek yogurt (plain, non-fat)",
          "Mixed berries (strawberries, blueberries, raspberries)",
          "Almonds"
        ],
        "preparation": "Combine greek yogurt, berries, and almonds in a bowl.",
        "nutritionalBenefits": "High in protein from greek yogurt, antioxidants from berries, and healthy fats from almonds.",
        "healthNotes": "Helps to curb hunger between meals and provides additional protein for muscle building."
      }
    ]
  },
  "nutritionalFocus": [
    {
      "nutrient": "Protein",
      "reason": "Essential for muscle repair and growth, especially important for Julie's goal of muscle building.",
      "sources": [
        "Eggs",
        "Ricotta cheese",
        "Lentils",
        "Greek Yogurt",
        "Almonds"
      ]
    },
    {
      "nutrient": "Iron",
      "reason": "Important for oxygen transport to muscles and preventing anemia, especially important for females.",
      "sources": [
        "Spinach",
        "Lentils",
        "Whole Wheat Pasta",
        "Almonds"
      ]
    },
    {
      "nutrient": "Complex Carbohydrates",
      "reason": "Provide sustained energy for workouts and daily activities.",
      "sources": [
        "Whole Wheat Toast",
        "Whole Wheat Pasta",
        "Whole Wheat Pizza Dough",
        "Vegetables"
      ]
    }
  ],
  "avoidList": [],
  "weeklyHabitTips": [
    "Incorporate strength training exercises 3-4 times per week to maximize muscle growth.",
    "Ensure adequate hydration by drinking at least 8 glasses of water per day.",
    "Prioritize getting 7-8 hours of sleep per night for optimal muscle recovery.",
    "Meal prep in advance to stay on track with your dietary goals."
  ]
}