{
  "dailyPlan": {
    "breakfast": {
      "name": "Vegan Mexican Tofu Scramble",
      "ingredients": [
        "1/2 cup crumbled firm tofu",
        "1/4 cup diced onion",
        "1/4 cup diced bell pepper (any color)",
        "1 tablespoon chopped cilantro",
        "1/2 teaspoon chili powder",
        "1/4 teaspoon cumin",
        "Pinch of turmeric (for color)",
        "1 tablespoon nutritional yeast (for cheesy flavor)",
        "1 corn tortilla (gluten-free if needed)",
        "1 tablespoon dairy-free salsa (check ingredients for phenylalanine content)",
        "1 tablespoon avocado (optional, for healthy fats)"
      ],
      "preparation": "Sauté onion and bell pepper until softened. Add tofu, spices, and nutritional yeast. Cook until heated through and tofu is lightly browned. Stir in cilantro. Serve on a warm corn tortilla with salsa and avocado.",
      "nutritionalBenefits": "Provides plant-based protein, fiber, and vitamins from vegetables. Tofu is a source of essential amino acids, important for growth and development.",
      "healthNotes": "Carefully measure tofu and monitor phenylalanine intake. Ensure salsa and other ingredients are free of added phenylalanine or derivatives. Avocado provides healthy fats for brain development and satiety."
    },
    "lunch": {
      "name": "Vegan Mexican Quinoa Bowl with Black Beans and Vegetables",
      "ingredients": [
        "1/2 cup cooked quinoa",
        "1/4 cup black beans (check phenylalanine content)",
        "1/4 cup diced tomatoes",
        "1/4 cup diced cucumber",
        "1/4 cup diced red onion",
        "1 tablespoon chopped cilantro",
        "1 tablespoon lime juice",
        "1 tablespoon olive oil",
        "Salt and pepper to taste",
        "1 corn tortilla, cut into strips (optional, for added texture - gluten-free if needed)"
      ],
      "preparation": "Combine all ingredients in a bowl. Toss gently. Top with tortilla strips if desired.",
      "nutritionalBenefits": "Provides complete protein from quinoa, fiber from black beans and vegetables, and healthy fats from olive oil. Lime juice provides vitamin C.",
      "healthNotes": "Monitor black bean intake due to potential phenylalanine content. Quinoa is a good source of protein and fiber. Ensure all vegetables are fresh and properly washed."
    },
    "dinner": {
      "name": "Vegan Mexican Vegetable Fajitas with Corn Tortillas",
      "ingredients": [
        "1/2 cup sliced bell peppers (various colors)",
        "1/4 cup sliced onion",
        "1/4 cup sliced zucchini",
        "1/4 cup sliced mushrooms",
        "1 tablespoon olive oil",
        "1/2 teaspoon chili powder",
        "1/4 teaspoon cumin",
        "1 tablespoon lime juice",
        "3 corn tortillas (gluten-free if needed)",
        "Dairy-free sour cream alternative (check phenylalanine content)",
        "Dairy-free cheese alternative (check phenylalanine content)"
      ],
      "preparation": "Sauté bell peppers, onion, zucchini, and mushrooms in olive oil with chili powder and cumin until tender-crisp. Stir in lime juice. Serve in warm corn tortillas with dairy-free sour cream and cheese alternatives.",
      "nutritionalBenefits": "Provides vitamins and minerals from a variety of vegetables. Corn tortillas provide carbohydrates for energy.",
      "healthNotes": "Carefully check the phenylalanine content of dairy-free sour cream and cheese alternatives. Load up on vegetables for optimal nutrition. Consider adding small amounts of pre-approved low-phenylalanine sauces or seasonings for flavour."
    },
    "snacks": [
      {
        "name": "Small Portion of Fruit Salad with Dairy-Free Yogurt",
        "ingredients": [
          "1/4 cup mixed berries (strawberries, blueberries, raspberries - check phenylalanine content)",
          "1/4 cup diced melon (cantaloupe, watermelon)",
          "1/4 cup dairy-free yogurt (check phenylalanine content)"
        ],
        "preparation": "Combine all ingredients in a small bowl.",
        "nutritionalBenefits": "Provides vitamins, minerals, and antioxidants from fruit. Dairy-free yogurt provides probiotics for gut health (choose a brand with added calcium and vitamin D).",
        "healthNotes": "Monitor berry and yogurt intake for phenylalanine content. Choose fruit naturally low in phenylalanine. Ensure dairy-free yogurt is fortified with calcium and vitamin D."
      }
    ]
  },
  "nutritionalFocus": [
    {
      "nutrient": "Phenylalanine",
      "reason": "Managing phenylalanine intake is crucial for individuals with phenylketonuria (PKU) to prevent neurological damage and developmental delays.",
      "sources": [
        "Tofu (moderate)",
        "Black beans (moderate)",
        "Dairy products (avoid dairy based sour cream and cheese alternatives unless labeled phenylalanine free)",
        "Some nuts and seeds (avoid high phenylalanine varieties)",
        "Many artificial sweeteners (check labels)"
      ]
    },
    {
      "nutrient": "Calcium",
      "reason": "Important for bone health, especially during growth spurts. Vegan diets require careful planning to ensure adequate calcium intake, especially with limited dairy intake due to PKU limitations.",
      "sources": [
        "Calcium-fortified plant milks",
        "Calcium-set tofu",
        "Leafy green vegetables (in moderation, considering other dietary needs)",
        "Fortified cereals",
        "Some fortified dairy-free yogurts"
      ]
    },
    {
      "nutrient": "Iron",
      "reason": "Essential for oxygen transport and energy production. Plant-based iron is less readily absorbed than animal-based iron, so strategies to enhance absorption are important.",
      "sources": [
        "Quinoa",
        "Black beans (moderate)",
        "Dark leafy green vegetables (in moderation, considering other dietary needs)",
        "Iron-fortified cereals and breads",
        "Tofu"
      ]
    }
  ],
  "avoidList": [
    {
      "food": "High-protein foods",
      "reason": "High-protein foods are generally high in phenylalanine and should be limited in the diet of someone with PKU. Protein intake should be carefully monitored and controlled."
    },
    {
      "food": "Aspartame (NutraSweet, Equal)",
      "reason": "Aspartame is an artificial sweetener that contains phenylalanine and should be strictly avoided."
    }
  ],
  "weeklyHabitTips": [
    "Track phenylalanine intake meticulously using a food diary or specialized PKU diet tracking app.",
    "Consult regularly with a registered dietitian specializing in PKU to adjust the diet plan as needed.",
    "Prepare meals at home as often as possible to ensure control over ingredients and phenylalanine content.",
    "Focus on naturally low-phenylalanine fruits and vegetables to add variety and nutrients to the diet.",
    "Read all food labels carefully, paying attention to protein content and the presence of aspartame or other phenylalanine sources.",
    "Spread protein intake throughout the day rather than consuming large amounts at one meal."
  ]
}